In [58]:
import numpy as np
import pandas as pd

In [59]:
from numpy.random import randn

In [60]:
np.random.seed(101)

In [61]:
ord('q')

113

In [62]:
ord('a')

97

In [63]:
d = {'A':[1, 2, 3],'B':[23,np.nan,21],'C':[12,np.nan,np.nan]}

In [64]:
df = pd.DataFrame(d)

In [65]:
df

   A     B     C
0  1  23.0  12.0
1  2   NaN   NaN
2  3  21.0   NaN

In [66]:
df.loc[0]

A     1.0
B    23.0
C    12.0
Name: 0, dtype: float64

In [67]:
df['A']

0    1
1    2
2    3
Name: A, dtype: int64

In [68]:
df.dropna()

   A     B     C
0  1  23.0  12.0

In [73]:
df.dropna(thresh=2)

   A     B     C
0  1  23.0  12.0
2  3  21.0   NaN

In [72]:
df

   A     B     C
0  1  23.0  12.0
1  2   NaN   NaN
2  3  21.0   NaN

In [50]:
df.dropna(axis=1)

   A
0  1
1  2
2  3

In [51]:
df = df*1.0

In [52]:
df

     A     B     C
0  1.0  23.0  12.0
1  2.0   NaN   NaN
2  3.0  21.0   NaN

In [53]:
df.loc[1]['A']

2.0

In [54]:
df['A']

0    1.0
1    2.0
2    3.0
Name: A, dtype: float64

In [55]:
df['A'].mean()

2.0

In [56]:
df.fillna(df['A'].mean(),inplace=True)

In [57]:
df

     A     B     C
0  1.0  23.0  12.0
1  2.0   2.0   2.0
2  3.0  21.0   2.0